driver-tests/sqlse/derby/insertwrongtypefullqualJbi/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sql="http://com.sun.jbi/sqlse/sqlseengine">
  <soapenv:Body>
    <sql:insertwrongtypefullqualRequest>
      <sql:param1>asd</sql:param1>
      <sql:param2>201</sql:param2>
      <sql:param3>sdf</sql:param3>
      <sql:param4>xcv</sql:param4>
    </sql:insertwrongtypefullqualRequest>
  </soapenv:Body>
</soapenv:Envelope>